_archive/pi-native-completion-evidence/artifacts/validation/final-tip-7c63/mutation-durable.patch
--- internal/ensigncycle/auto_continue_fixtures_test.go
+++ durable
@@ -266,15 +266,6 @@
 	if strings.TrimSpace(git(t, reportRepo, "log", "-1", "--format=%H", "-S## Stage Report: validation", "--", rel)) == "" {
 		return fmt.Errorf("validation report has no durable commit")
 	}
-	// The current report must be committed, not just an earlier version that
-	// introduced its heading. Gate/frontmatter mutations can live in another copy.
-	committed := git(t, reportRepo, "show", "HEAD:"+filepath.ToSlash(rel))
-	currentSpans, currentErr := status.FindSectionSpans(report, []string{"Stage Report: validation"})
-	committedSpans, committedErr := status.FindSectionSpans([]byte(committed), []string{"Stage Report: validation"})
-	if currentErr != nil || committedErr != nil || len(currentSpans) != 1 || len(committedSpans) != 1 ||
-		strings.TrimSpace(string(report[currentSpans[0].Start:currentSpans[0].End])) != strings.TrimSpace(committed[committedSpans[0].Start:committedSpans[0].End]) {
-		return fmt.Errorf("current validation report has no durable commit")
-	}
 	// The gate record and the validation report do not reliably live in the same
 	// copy of a worktree-backed entity, and the placement differs by host: codex
 	// files the report in the worktree copy and the gate record in the base copy,
